<template>
  <div>
    <section>
      <h3>递归</h3>
      <p>函数中调用这个函数自身</p>
      <pre>
函数的内部语句可以调用这个函数自身，从而发起对函数的一次迭代;
在新的迭代中，又会执行调用函数自身的语句，从而又产生一次迭代;
当函数执行到某一次时，不再进行新的迭代，函数被一层一层返回，函数被递归.
它把一个大型复杂的问题，层层转化为一个与原问题相似的，但规模较小的问题来求解
      </pre>

      <h3>遍历访问</h3>
      <p>遍历通常指的是按照某种顺序访问数据结构中的每个元素；</p>
      <pre>

顺序遍历：对于线性数据结构（如数组、链表），按照元素的顺序一个接一个地访问。

深度优先遍历（DFS）：对于树或图，从根节点开始，尽可能深地搜索树的分支。
从根节点出发，按照从左到右的顺序，访问其子节点，如果子节点还有子节点，则一直向下访问，直到没有子节点为止。
从某个顶点出发，首先访问这个顶点，然后找出刚访问这个结点的第一个未被访问的邻结点，然后再以此邻结点为顶点，继续找它的下一个顶点进行访问。重复此步骤，直至所有结点都被访问完为止

广度优先遍历（BFS）：对于树或图，从根节点开始，先访问所有相邻节点，然后逐层向外扩展。
简单点说就是从根节点出发，一层一层的从上向下访问，同层节点从左往右访问，直到所有的节点都被访问到为止。
是从某个顶点出发，首先访问这个顶点，然后找出刚访问这个结点所有未被访问的邻结点，访问完后再访问这些结点中第一个邻结点的所有结点，重复此方法，直到所有结点都被访问完为止

二叉树遍历：对于二叉树，有前序遍历（根-左-右）、中序遍历（左-根-右）和后序遍历（左-右-根）三种主要方式。
图的遍历：对于图，可以使用DFS或BFS来访问图中的所有顶点。
层次遍历：对于多维数组或矩阵，可以按行或按列逐层访问
      </pre>

      <h3>排序</h3>
      <p>
        将一系列元素（如数字、字符串等）按照一定的顺序（通常是升序或降序）排列的过程
      </p>
      <pre>
1.冒泡排序是一种交换排序，基本思想是：两两比较相邻记录的关键字，如果反序则交换，直到没有反序的记录为止。
2.快速排序的基本思想是：通过一趟排序将待排记录分割成独立的两部分，其中一部分记录的元素均比另一部分记录的元素小，继而再分别对这两部分记录递归的进行同样的排序操作。
3.归并排序是利用归并的思想实现的排序方法，该算法采用经典的分治策略（分治法将问题分成一些小的问题然后递归求解，而治的阶段则将分的阶段得到的各答案"修补"在一起，即分而治之)。
      </pre>

      <h3>查找</h3>
      <pre>
1. 线性查找（Linear Search）
线性查找是一种最简单的查找算法，它逐个检查数据结构中的每个元素，直到找到所需的元素或检查完所有元素为止。这种查找方法适用于无序数据结构。

2. 二分查找（Binary Search）
二分查找是一种在有序数组中查找特定元素的算法。它通过反复将待查找的元素与数组中间元素进行比较，缩小查找范围，直到找到元素或查找范围为空。

3. 插值查找（Interpolation Search）
插值查找是二分查找的一种改进版，它利用数据分布的特性来预测查找的下一位位置。如果数据分布均匀，插值查找可以更快地缩小查找范围。

4. 指数查找（Exponential Search）
指数查找首先使用二分查找的思想来确定待查找元素的大致范围，然后在这个范围内进行线性查找。

5. 斐波那契查找（Fibonacci Search）
斐波那契查找类似于二分查找，但它使用斐波那契数列来减少搜索区间的大小。斐波那契查找可以减少比较次数，但查找过程中的索引计算较为复杂。

6. 哈希查找（Hash Search）
哈希查找通过哈希函数将键映射到表中一个位置，以支持快速的插入、删除和查找操作。哈希查找的平均时间复杂度为O(1)，但在最坏情况下可能退化到O(n)。

8. 深度优先搜索（Depth-First Search, DFS）
深度优先搜索用于树或图结构中，从一个节点开始，尽可能深地搜索树/图的分支。

9. 广度优先搜索（Breadth-First Search, BFS）
广度优先搜索也是用于树或图结构中，从一个节点开始，先访问所有相邻节点，再逐层向外扩展。


      </pre>
    </section>
  </div>
</template>

<script>
export default {
  name: "xxx",
  components: {},
  data() {
    return {};
  },
  mounted() {},
  methods: {},
};
</script>
